tutorials/rectangle_with_massFlow/Allrun
source $WM_PROJECT_DIR/bin/tools/RunFunctions

foamCleanCase
runApplication blockMesh
runApplication decomposePar

#-----------------------------
# rm log.foamRun
#rm log.reconstructPar
#rm -r postProcessing
# foamListTimes -rm
# foamListTimes -processor -time 0: -rm

# runParallel `getApplication`
mpirun -np 12 foamRun -parallel | tee log.foamRun
# runApplication reconstructPar

